depletionmode/cupc8/emu/rp2040/src/peripherals/pio.cpp
// Port of rp2040js src/peripherals/pio.ts (with the cupc8 dual-core patch).
//
// JS numbers: see the note on StateMachine in pio.h. Every shift below has a
// count in 0..31 unless commented (then jsShl/jsSar or an explicit & 31).
#include "pio.h"

#include <algorithm>
#include <tuple>
#include <type_traits>

#include "../rp2040.h"
#include "../utils/js.h"

namespace rp2040js {

// Generic registers
static constexpr uint32_t CTRL = 0x000;
static constexpr uint32_t FSTAT = 0x004;
static constexpr uint32_t FDEBUG = 0x008;
static constexpr uint32_t FLEVEL = 0x00c;
// `IRQ` in TS; renamed: it clashes with `namespace IRQ` (irq.h)
static constexpr uint32_t IRQ_ = 0x030;
static constexpr uint32_t IRQ_FORCE = 0x034;
static constexpr uint32_t INPUT_SYNC_BYPASS = 0x038;
static constexpr uint32_t DBG_PADOUT = 0x03c;
static constexpr uint32_t DBG_PADOE = 0x040;
static constexpr uint32_t DBG_CFGINFO = 0x044;
static constexpr uint32_t INSTR_MEM0 = 0x48;
static constexpr uint32_t INSTR_MEM31 = 0x0c4;

static constexpr uint32_t INTR = 0x128;       // Raw Interrupts
static constexpr uint32_t IRQ0_INTE = 0x12c;  // Interrupt Enable for irq0
static constexpr uint32_t IRQ0_INTF = 0x130;  // Interrupt Force for irq0
static constexpr uint32_t IRQ0_INTS = 0x134;  // Interrupt status after masking & forcing for irq0
static constexpr uint32_t IRQ1_INTE = 0x138;  // Interrupt Enable for irq1
static constexpr uint32_t IRQ1_INTF = 0x13c;  // Interrupt Force for irq1
static constexpr uint32_t IRQ1_INTS = 0x140;  // Interrupt status after masking & forcing for irq1

// State-machine specific registers
static constexpr uint32_t TXF0 = 0x010;
static constexpr uint32_t TXF1 = 0x014;
static constexpr uint32_t TXF2 = 0x018;
static constexpr uint32_t TXF3 = 0x01c;
static constexpr uint32_t RXF0 = 0x020;
static constexpr uint32_t RXF1 = 0x024;
static constexpr uint32_t RXF2 = 0x028;
static constexpr uint32_t RXF3 = 0x02c;
static constexpr uint32_t SM0_CLKDIV = 0x0c8;     // Clock divisor register for state machine 0
static constexpr uint32_t SM0_EXECCTRL = 0x0cc;   // Execution/behavioural settings for state machine 0
static constexpr uint32_t SM0_SHIFTCTRL = 0x0d0;  // Control behaviour of the input/output shift registers for state machine 0
static constexpr uint32_t SM0_ADDR = 0x0d4;       // Current instruction address of state machine 0
static constexpr uint32_t SM0_INSTR = 0x0d8;  // Write to execute an instruction immediately (including jumps) and then resume execution.
static constexpr uint32_t SM0_PINCTRL = 0x0dc;  // State machine pin control
static constexpr uint32_t SM1_CLKDIV = 0x0e0;
static constexpr uint32_t SM1_PINCTRL = 0x0f4;
static constexpr uint32_t SM2_CLKDIV = 0x0f8;
static constexpr uint32_t SM2_PINCTRL = 0x10c;
static constexpr uint32_t SM3_CLKDIV = 0x110;
static constexpr uint32_t SM3_PINCTRL = 0x124;

// FSTAT bits
static constexpr uint32_t FSTAT_TXEMPTY = 1u << 24;
static constexpr uint32_t FSTAT_TXFULL = 1u << 16;
static constexpr uint32_t FSTAT_RXEMPTY = 1u << 8;
static constexpr uint32_t FSTAT_RXFULL = 1u << 0;

// FDEBUG bits
static constexpr uint32_t FDEBUG_TXSTALL = 1u << 24;
static constexpr uint32_t FDEBUG_TXOVER = 1u << 16;
static constexpr uint32_t FDEBUG_RXUNDER = 1u << 8;
static constexpr uint32_t FDEBUG_RXSTALL = 1u << 0;

// SHIFTCTRL bits
static constexpr uint32_t SHIFTCTRL_AUTOPUSH = 1u << 16;
static constexpr uint32_t SHIFTCTRL_AUTOPULL = 1u << 17;
static constexpr uint32_t SHIFTCTRL_IN_SHIFTDIR = 1u << 18;  // 1 = shift input shift register to right (data enters from left). 0 = to left
static constexpr uint32_t SHIFTCTRL_OUT_SHIFTDIR = 1u << 19;  // 1 = shift out of output shift register to right. 0 = to left
static constexpr uint32_t SHIFTCTRL_FJOIN_TX = 1u << 30;
static constexpr uint32_t SHIFTCTRL_FJOIN_RX = 1u << 31;

// EXECCTRL bits
static constexpr uint32_t EXECCTRL_STATUS_SEL = 1u << 4;
static constexpr uint32_t EXECCTRL_SIDE_PINDIR = 1u << 29;
static constexpr uint32_t EXECCTRL_SIDE_EN = 1u << 30;
static constexpr uint32_t EXECCTRL_EXEC_STALLED = 1u << 31;

static inline uint32_t bitReverse(uint32_t x) {
  x = ((x & 0x55555555) << 1) | ((x & 0xaaaaaaaa) >> 1);
  x = ((x & 0x33333333) << 2) | ((x & 0xcccccccc) >> 2);
  x = ((x & 0x0f0f0f0f) << 4) | ((x & 0xf0f0f0f0) >> 4);
  x = ((x & 0x00ff00ff) << 8) | ((x & 0xff00ff00) >> 8);
  x = ((x & 0x0000ffff) << 16) | ((x & 0xffff0000) >> 16);
  return x;
}

static inline uint32_t irqIndex(uint32_t irq, uint32_t machineIndex) {
  const bool rel = !!(irq & 0x10);
  return rel ? (irq & 0x4) | (((irq & 0x3) + machineIndex) & 0x3) : irq & 0x7;
}

static const std::array<DREQChannel, 4> dreqRx0 = {DREQ_PIO0_RX0, DREQ_PIO0_RX1, DREQ_PIO0_RX2, DREQ_PIO0_RX3};
static const std::array<DREQChannel, 4> dreqTx0 = {DREQ_PIO0_TX0, DREQ_PIO0_TX1, DREQ_PIO0_TX2, DREQ_PIO0_TX3};
static const std::array<DREQChannel, 4> dreqRx1 = {DREQ_PIO1_RX0, DREQ_PIO1_RX1, DREQ_PIO1_RX2, DREQ_PIO1_RX3};
static const std::array<DREQChannel, 4> dreqTx1 = {DREQ_PIO1_TX0, DREQ_PIO1_TX1, DREQ_PIO1_TX2, DREQ_PIO1_TX3};

/** `(1 << n) - 1` for n in 0..31, as the int32 pattern JS produces (n = 31 gives 0x7fffffff). */
static inline uint32_t lowMask(uint32_t n) { return (1u << (n & 31)) - 1u; }

// ---------------------------------------------------------------------------
// StateMachine

StateMachine::StateMachine(RP2040 &rp2040, RPPIO &pio, uint32_t index)
    : rp2040(rp2040), pio(pio), index(index), dreqRx(pio.dreqRx[index]), dreqTx(pio.dreqTx[index]) {
  updateDMARx();
  updateDMATx();
}

void StateMachine::updateDMATx() {
  if (txFIFO.full()) {
    rp2040.dma.clearDREQ(dreqTx);
  } else {
    rp2040.dma.setDREQ(dreqTx);
  }
}

void StateMachine::updateDMARx() {
  if (rxFIFO.empty()) {
    rp2040.dma.clearDREQ(dreqRx);
  } else {
    rp2040.dma.setDREQ(dreqRx);
  }
}

void StateMachine::writeFIFO(uint32_t value) {
  if (txFIFO.full()) {
    pio.fdebug |= FDEBUG_TXOVER << index;
    return;
  }
  txFIFO.push(value);
  pio.txStall &= ~(FDEBUG_TXSTALL << index);
  updateDMATx();
  checkWait();
  if (txFIFO.full()) {
    pio.checkInterrupts();
  }
}

uint32_t StateMachine::readFIFO() {
  if (rxFIFO.empty()) {
    pio.fdebug |= FDEBUG_RXUNDER << index;
    return 0;
  }
  const uint32_t result = rxFIFO.pull();
  pio.rxStall &= ~(FDEBUG_RXSTALL << index);
  updateDMARx();
  checkWait();
  if (rxFIFO.empty()) {
    pio.checkInterrupts();
  }
  return result;
}

