depletionmode/cupc8/emu/rp2040/src/peripherals/pio.cpp
uint32_t StateMachine::status() const {
  const uint32_t statusN = execCtrl & 0xf;
  if (execCtrl & EXECCTRL_STATUS_SEL) {
    return rxFIFO.itemCount() < statusN ? 0xffffffff : 0;
  } else {
    return txFIFO.itemCount() < statusN ? 0xffffffff : 0;
  }
}

bool StateMachine::jmpCondition(uint32_t condition) {
  switch (condition) {
    // (no condition): Always
    case 0b000:
      return true;

    // !X: scratch X zero
    case 0b001:
      return x == 0;

    // X--: scratch X non-zero, post-decrement
    case 0b010: {
      const uint32_t oldX = x;
      x = x - 1;  // `(this.x - 1) >>> 0`: exact for any int32/uint32 pattern
      return oldX != 0;
    }

    // !Y: scratch Y zero
    case 0b011:
      return y == 0;

    // Y--: scratch Y non-zero, post-decrement
    case 0b100: {
      const uint32_t oldY = y;
      y = y - 1;
      return oldY != 0;
    }

    // X!=Y: scratch X not equal scratch Y
    case 0b101:
      return x != y;

    // PIN: branch on input pin
    case 0b110: {
      auto &gpio = rp2040.gpio;
      const uint32_t jmpPin = this->jmpPin();
      return jmpPin < gpio.size() ? gpio[jmpPin].inputValue() : false;
    }

    // !OSRE: output shift register not empty
    case 0b111:
      return outputShiftCount < pullThreshold();
  }

  pio.error("jmpCondition with unsupported condition: " + std::to_string(condition));
  return false;
}

uint32_t StateMachine::inPins() const {
  const uint32_t gpioValues = rp2040.gpioValues();
  const uint32_t inBase = this->inBase();
  return inBase ? (gpioValues << (32 - inBase)) | (gpioValues >> inBase) : gpioValues;
}

uint32_t StateMachine::inSourceValue(uint32_t source) {
  switch (source) {
    // PINS
    case 0b000:
      return inPins();

    // X (scratch register X)
    case 0b001:
      return x;

    // Y (scratch register Y)
    case 0b010:
      return y;

    // NULL (all zeroes)
    case 0b011:
      return 0;

    // Reserved
    case 0b100:
      return 0;

    // Reserved for IN, STATUS for MOV
    case 0b101:
      return status();

    // ISR
    case 0b110:
      return inputShiftReg;

    // OSR
    case 0b111:
      return outputShiftReg;
  }

  pio.error("inSourceValue with unsupported source: " + std::to_string(source));
  return 0;
}

void StateMachine::writeOutValue(uint32_t destination, uint32_t value, uint32_t bitCount) {
  switch (destination) {
    // PINS
    case 0b000:
      setOutPins(value);
      break;

    // X (scratch register X)
    case 0b001:
      x = value;
      break;

    // Y (scratch register Y)
    case 0b010:
      y = value;
      break;

    // NULL (discard data)
    case 0b011:
      break;

    // PINDIRS
    case 0b100:
      setOutPinDirs(value);
      break;

    // PC
    case 0b101:
      pc = value & 0x1f;
      updatePC = false;
      break;

    // ISR (also sets ISR shift counter to Bit count)
    case 0b110:
      inputShiftReg = value;
      inputShiftCount = bitCount;
      break;

    // EXEC (Execute OSR shift data as instruction)
    case 0b111:
      execOpcode = value;
      execValid = true;
      break;
  }
}

uint32_t StateMachine::pushThreshold() const {
  const uint32_t value = (shiftCtrl >> 20) & 0x1f;
  return value ? value : 32;
}

uint32_t StateMachine::pullThreshold() const {
  const uint32_t value = (shiftCtrl >> 25) & 0x1f;
  return value ? value : 32;
}

uint32_t StateMachine::sidesetCount() const { return (pinCtrl >> 29) & 0x7; }

uint32_t StateMachine::setCount() const { return (pinCtrl >> 26) & 0x7; }

uint32_t StateMachine::outCount() const { return (pinCtrl >> 20) & 0x3f; }

uint32_t StateMachine::inBase() const { return (pinCtrl >> 15) & 0x1f; }

uint32_t StateMachine::sidesetBase() const { return (pinCtrl >> 10) & 0x1f; }

uint32_t StateMachine::setBase() const { return (pinCtrl >> 5) & 0x1f; }

uint32_t StateMachine::outBase() const { return (pinCtrl >> 0) & 0x1f; }

uint32_t StateMachine::jmpPin() const { return (execCtrl >> 24) & 0x1f; }

uint32_t StateMachine::wrapTop() const { return (execCtrl >> 12) & 0x1f; }

uint32_t StateMachine::wrapBottom() const { return (execCtrl >> 7) & 0x1f; }

void StateMachine::setOutPinDirs(uint32_t value) {
  outPinDirection = value;
  pio.pinDirectionsChanged(value, outBase(), outCount());
}

void StateMachine::setOutPins(uint32_t value) {
  outPinValues = value;
  pio.pinValuesChanged(value, outBase(), outCount());
}

void StateMachine::outInstruction(uint32_t arg) {
  const uint32_t bitCount = arg & 0x1f;
  const uint32_t destination = arg >> 5;

  if (bitCount == 0) {
    writeOutValue(destination, outputShiftReg, 32);
    outputShiftCount = 32;
  } else {
    if (shiftCtrl & SHIFTCTRL_OUT_SHIFTDIR) {
      const uint32_t value = outputShiftReg & lowMask(bitCount);
      outputShiftReg >>= bitCount;
      writeOutValue(destination, value, bitCount);
    } else {
      const uint32_t value = outputShiftReg >> (32 - bitCount);
      outputShiftReg <<= bitCount;
      writeOutValue(destination, value, bitCount);
    }
    outputShiftCount += bitCount;
    if (outputShiftCount > 32) {
      outputShiftCount = 32;
    }
  }
}

void StateMachine::executeInstruction(uint32_t opcode) {
  const uint32_t arg = opcode & 0xff;
  // `opcode >>> 13`: opcode is 16 bits (instructions[], `value & 0xffff`) except
  // for EXEC, whose opcode is a 32-bit OUT/MOV value; then this is 0..0x7ffff
  // and matches no case, exactly as in TS.
  switch (opcode >> 13) {
    /* JMP */
    case 0b000:
      if (jmpCondition(arg >> 5)) {
        pc = arg & 0x1f;
        updatePC = false;
      }
      break;

    /* WAIT */
    case 0b001: {
      const bool polarity = !!(arg & 0x80);
      const uint32_t source = (arg >> 5) & 0x3;
      const uint32_t index = arg & 0x1f;
      switch (source) {
        // GPIO:
        case 0b00:
          wait(WaitType::Pin, polarity, index);
          break;

        // PIN:
        case 0b01:
          wait(WaitType::Pin, polarity, (index + inBase()) % 32);
          break;

        // IRQ:
        case 0b10:
          wait(WaitType::IRQ, polarity, irqIndex(index, this->index));
          break;
      }
      break;
    }

