depletionmode/cupc8/emu/rp2040/src/peripherals/pio.cpp
uint32_t StateMachine::transformMovValue(uint32_t value, uint32_t op) {
  // The caller applies `>>> 0` (so `~value` is only ever seen as a pattern).
  switch (op) {
    case 0b00:
      return value;
    case 0b01:
      return ~value;
    case 0b10:
      return bitReverse(value);
    case 0b11:
    default:
      return value;  // reserved
  }
}

void StateMachine::setMovDestination(uint32_t destination, uint32_t value) {
  switch (destination) {
    // PINS
    case 0b000:
      setOutPins(value);
      break;

    // X (scratch register X)
    case 0b001:
      x = value;
      break;

    // Y (scratch register Y)
    case 0b010:
      y = value;
      break;

    // reserved (discard data)
    case 0b011:
      break;

    // EXEC
    case 0b100:
      execOpcode = value;
      execValid = true;
      break;

    // PC
    case 0b101:
      pc = value & 0x1f;
      updatePC = false;
      break;

    // ISR (Input shift counter is reset to 0 by this operation, i.e. empty)
    case 0b110:
      inputShiftReg = value;
      inputShiftCount = 0;
      break;

    // OSR (Output shift counter is reset to 0 by this operation, i.e. full)
    case 0b111:
      outputShiftReg = value;
      outputShiftCount = 0;
      break;
  }
}

uint32_t StateMachine::readUint32(uint32_t offset) {
  switch (offset + SM0_CLKDIV) {
    case SM0_CLKDIV:
      return (clockDivInt << 16) | (clockDivFrac << 8);
    case SM0_EXECCTRL:
      return execCtrl;
    case SM0_SHIFTCTRL:
      return shiftCtrl;
    case SM0_ADDR:
      return pc;
    case SM0_INSTR:
      return pio.instructions[pc];
    case SM0_PINCTRL:
      return pinCtrl;
  }
  pio.error("Read from invalid state machine register: " + std::to_string(offset));
  return 0;
}

void StateMachine::writeUint32(uint32_t offset, uint32_t value) {
  switch (offset + SM0_CLKDIV) {
    case SM0_CLKDIV:
      clockDivFrac = (value >> 8) & 0xff;
      clockDivInt = value >> 16;
      break;
    case SM0_EXECCTRL:
      execCtrl = (value & 0x7fffffff) | (execCtrl & 0x80000000);
      break;
    case SM0_SHIFTCTRL: {
      // Changing either join bit flushes both FIFOs (pio_sm_clear_fifos
      // relies on this); joining gives one FIFO all 8 entries.
      const uint32_t join = SHIFTCTRL_FJOIN_TX | SHIFTCTRL_FJOIN_RX;
      if ((value ^ shiftCtrl) & join) {
        const uint32_t tx = value & SHIFTCTRL_FJOIN_TX ? 8 : value & SHIFTCTRL_FJOIN_RX ? 0 : 4;
        const uint32_t rx = value & SHIFTCTRL_FJOIN_RX ? 8 : value & SHIFTCTRL_FJOIN_TX ? 0 : 4;
        txFIFO.resize(tx);
        rxFIFO.resize(rx);
        updateDMATx();
        updateDMARx();
      }
      shiftCtrl = value;
      break;
    }
    case SM0_ADDR:
      /* read-only */
      break;
    case SM0_INSTR:
      executeInstruction(value & 0xffff);
      if (waiting) {
        execCtrl |= EXECCTRL_EXEC_STALLED;
      }
      break;
    case SM0_PINCTRL:
      pinCtrl = value;
      break;
    default:
      pio.error("Write to invalid state machine register: " + std::to_string(offset));
  }
}

uint32_t StateMachine::fifoStat() const {
  const uint32_t result = (txFIFO.empty() ? FSTAT_TXEMPTY : 0) | (txFIFO.full() ? FSTAT_TXFULL : 0) |
                          (rxFIFO.empty() ? FSTAT_RXEMPTY : 0) | (rxFIFO.full() ? FSTAT_RXFULL : 0);
  return result << index;
}

void StateMachine::restart() {
  cycles = 0;
  delayLeft = 0;
  inputShiftCount = 0;
  outputShiftCount = 32;
  inputShiftReg = 0;
  waiting = false;
  // TODO any pin write left asserted due to OUT_STICKY.
}

void StateMachine::clkDivRestart() { divPhase = 0; }

void StateMachine::clockTick() {
  if (!enabled) {
    return;
  }
  const uint32_t div = (clockDivInt ? clockDivInt : 65536) * 256 + clockDivFrac;
  divPhase += 256;
  if (divPhase >= div) {
    divPhase -= div;
    step();
  }
}

void StateMachine::checkWait() {
  if (!waiting) {
    return;
  }

  switch (waitType) {
    case WaitType::IRQ: {
      // waitIndex is an IRQ number 0..7 here (irqIndex)
      const bool irqValue = !!(pio.irq & (1u << (waitIndex & 31)));
      if (irqValue == waitPolarity) {
        waiting = false;
        if (irqValue) {
          pio.irq &= ~(1u << (waitIndex & 31));
        }
      }
      break;
    }

    case WaitType::Pin: {
      if (waitIndex < rp2040.gpio.size() && rp2040.gpio[waitIndex].inputValue() == waitPolarity) {
        waiting = false;
      }
      break;
    }

    case WaitType::rxFIFO: {
      if (!rxFIFO.full()) {
        rxFIFO.push(waitIndex);
        waiting = false;
        updateDMARx();
        pio.checkInterrupts();
      }
      break;
    }

    case WaitType::txFIFO: {
      if (!txFIFO.empty()) {
        outputShiftReg = txFIFO.pull();
        waiting = false;
        updateDMATx();
        pio.checkInterrupts();
      }
      break;
    }

    case WaitType::Out: {
      if (!txFIFO.empty()) {
        outputShiftReg = txFIFO.pull();
        outInstruction(waitIndex);
        waiting = false;
        updateDMATx();
        pio.checkInterrupts();
      }
      break;
    }

    case WaitType::None:
      break;
  }

  if (!waiting) {
    nextPC();
    cycles += waitDelay;
    // a stalled instruction's delay starts once it completes
    delayLeft = std::max(0, waitDelay);
    execCtrl &= ~EXECCTRL_EXEC_STALLED;
  }
}

// ---------------------------------------------------------------------------
// RPPIO

RPPIO::RPPIO(RP2040 &rp2040, const std::string &name, uint32_t firstIrq, uint32_t index)
    : BasePeripheral(rp2040, name),
      firstIrq(firstIrq),
      index(index),
      dreqRx(index ? dreqRx1 : dreqRx0),
      dreqTx(index ? dreqTx1 : dreqTx0),
      machines{{{rp2040, *this, 0}, {rp2040, *this, 1}, {rp2040, *this, 2}, {rp2040, *this, 3}}} {
  // `run()`: one batch; TS then re-arms itself with `setTimeout(() => this.run(), 0)`
  // while not stopped (see pio.h).
  run = [this] {
    for (int i = 0; i < 1000 && !stopped; i++) {
      step();
    }
  };
}

uint32_t RPPIO::intRaw() const {
  return ((irq & 0xf) << 8) | (!machines[3].txFIFO.full() ? 0x80 : 0) | (!machines[2].txFIFO.full() ? 0x40 : 0) |
         (!machines[1].txFIFO.full() ? 0x20 : 0) | (!machines[0].txFIFO.full() ? 0x10 : 0) |
         (!machines[3].rxFIFO.empty() ? 0x08 : 0) | (!machines[2].rxFIFO.empty() ? 0x04 : 0) |
         (!machines[1].rxFIFO.empty() ? 0x02 : 0) | (!machines[0].rxFIFO.empty() ? 0x01 : 0);
}

uint32_t RPPIO::irq0IntStatus() const { return (intRaw() & irq0IntEnable) | irq0IntForce; }

uint32_t RPPIO::irq1IntStatus() const { return (intRaw() & irq1IntEnable) | irq1IntForce; }

/**
 * Fast path: a bus access sees and changes the exact state (sync() first),
 * and afterwards the block may go lazy again at once (the conditions are
 * checked on the state the access left), unless the access came from inside
 * the block's own step() (a GPIO listener), which checks at its end.
 */
struct PIOBusAccess {
  RPPIO &pio;
  explicit PIOBusAccess(RPPIO &pio) : pio(pio) { pio.sync(); }
  ~PIOBusAccess() {
    if (pio.fastPath && !pio.lazy && !pio.inStep) {
      pio.tryEnterLazy();
    }
  }
};

uint32_t RPPIO::readUint32(uint32_t offset) {
  const PIOBusAccess access(*this);
  if (offset >= SM0_CLKDIV && offset <= SM0_PINCTRL) {
    return machines[0].readUint32(offset - SM0_CLKDIV);
  }
  if (offset >= SM1_CLKDIV && offset <= SM1_PINCTRL) {
    return machines[1].readUint32(offset - SM1_CLKDIV);
  }
  if (offset >= SM2_CLKDIV && offset <= SM2_PINCTRL) {
    return machines[2].readUint32(offset - SM2_CLKDIV);
  }
  if (offset >= SM3_CLKDIV && offset <= SM3_PINCTRL) {
    return machines[3].readUint32(offset - SM3_CLKDIV);
  }

  switch (offset) {
    case CTRL:
      return (machines[0].enabled ? 1 << 0 : 0) | (machines[1].enabled ? 1 << 1 : 0) |
             (machines[2].enabled ? 1 << 2 : 0) | (machines[3].enabled ? 1 << 3 : 0);
    case FSTAT:
      return machines[0].fifoStat() | machines[1].fifoStat() | machines[2].fifoStat() | machines[3].fifoStat();
    case FDEBUG:
      return fdebug;
    case FLEVEL:
      return (machines[0].txFIFO.itemCount() & 0xf) | ((machines[0].rxFIFO.itemCount() & 0xf) << 4) |
             ((machines[1].txFIFO.itemCount() & 0xf) << 8) | ((machines[1].rxFIFO.itemCount() & 0xf) << 12) |
             ((machines[2].txFIFO.itemCount() & 0xf) << 16) | ((machines[2].rxFIFO.itemCount() & 0xf) << 20) |
             ((machines[3].txFIFO.itemCount() & 0xf) << 24) | ((machines[3].rxFIFO.itemCount() & 0xf) << 28);

