depletionmode/cupc8/emu/rp2040/src/peripherals/pio.cpp
bool RPPIO::lazyMachines(uint64_t &next, uint32_t &used) {
  next = UINT64_MAX;
  used = 0;
  for (StateMachine &sm : machines) {
    if (!sm.enabled) {
      continue;
    }
    if (sm.waiting) {
      if (!sm.stalledStable()) {
        return false;
      }
      continue;
    }
    if (sm.execValid || sm.delayLeft > 0 || sm.clockDivInt != 1 || sm.clockDivFrac != 0 ||
        !(sm.shiftCtrl & SHIFTCTRL_AUTOPULL)) {
      return false;
    }
    uint32_t mask, bits;
    const uint32_t pc = sm.pc & 0x1f;
    if (sm.analysedEpoch == progEpoch && sm.runnerPcs & (1u << pc)) {  // (runnerProgram's cache)
      mask = sm.runnerMask[pc];
      bits = sm.runnerBits[pc];
    } else if (!sm.runnerProgram(mask, bits)) {
      return false;
    }
    const uint32_t threshold = sm.pullThreshold(), count = sm.outputShiftCount;
    if (count >= threshold || (mask & used)) {
      return false;
    }
    used |= mask;
    // the instructions before the one that autopulls (the count caps at 32 >= threshold)
    next = std::min<uint64_t>(next, (threshold - count + bits - 1) / bits);
  }
  return true;
}

void RPPIO::tryEnterLazy() {
  if (oldPinValues != pinValues || oldPinDirections != pinDirections) {
    return;
  }
  uint64_t next;
  uint32_t used;
  if (!lazyMachines(next, used)) {
    return;
  }
  const uint32_t function = index ? FUNCTION_PIO1 : FUNCTION_PIO0;
  for (uint32_t bits = used & ((1u << rp2040.gpio.size()) - 1); bits; bits &= bits - 1) {
    const GPIOPin &pin = rp2040.gpio[static_cast<uint32_t>(__builtin_ctz(bits))];
    if (pin.hasListeners() || pin.functionSelect() != function) {
      return;
    }
  }
  lazy = true;
  owed = 0;
  nextEvent = next;
}

void RPPIO::catchUp() {
  const uint64_t cycles = owed;
  owed = 0;
  if (!cycles) {
    return;
  }
  lazyCycles += cycles;
  for (StateMachine &sm : machines) {
    if (!sm.enabled) {
      continue;
    }
    if (sm.waiting) {
      const uint64_t div = (sm.clockDivInt ? sm.clockDivInt : 65536) * 256ull + sm.clockDivFrac;
      sm.divPhase = static_cast<uint32_t>((sm.divPhase + 256 * cycles) % div);
      continue;
    }
    pendingTouched |= sm.runLazy(cycles);
  }
}

void RPPIO::flushPins() {
  const uint32_t touched = pendingTouched;
  pendingTouched = 0;
  oldPinValues = pinValues;
  oldPinDirections = pinDirections;
  auto &gpio = rp2040.gpio;
  for (uint32_t bits = touched & ((1u << gpio.size()) - 1); bits; bits &= bits - 1) {
    gpio[static_cast<uint32_t>(__builtin_ctz(bits))].checkForUpdates();
  }
}

void RPPIO::materialize() {
  lazy = false;
  catchUp();
  flushPins();
}

bool RPPIO::lazyEvent() {
  catchUp();
  // A runner autopulls now. The cycle is every machine's real clockTick():
  // the stalled ones and the runners that do not pull touch nothing outside
  // themselves and their pins, and the pull's effects (the FIFO, its DREQ,
  // the interrupt lines, txStall/fdebug on an underrun) are the exact ones,
  // in machine order. What is left of the exact step is checkChangedPins,
  // whose checkForUpdates calls stay deferred (pendingTouched) as in a lazy
  // cycle. That needs the pull's onPull hook, if any, not to touch the chip.
  for (StateMachine &sm : machines) {
    if (sm.enabled && !sm.waiting && sm.outputShiftCount >= sm.pullThreshold() && sm.txFIFO.onPull &&
        !sm.txFIFO.onPullRecordsOnly) {
      lazy = false;
      flushPins();
      return false;  // the exact step (all caught up)
    }
  }
  lazy = false;
  inStep = true;
  lazyEvents++;
  const uint32_t values = pinValues, directions = pinDirections;
  for (StateMachine &sm : machines) {
    sm.clockTick();
  }
  pendingTouched |= (values ^ pinValues) | (directions ^ pinDirections);
  inStep = false;
  // Nothing outside the block changed since the last tryEnterLazy (that
  // would have synced), and a runner's new pc is reachable from its old one:
  // its pins are a subset of the ones checked then. So only the machines'
  // own conditions need checking again.
  uint64_t next;
  uint32_t used;
  if (lazyMachines(next, used)) {
    lazy = true;
    owed = 0;
    nextEvent = next;
  } else {
    flushPins();  // the rest of the exact step: checkChangedPins
  }
  return true;
}

}  // namespace rp2040js
